# FALLOUT


FiveLetter = ['АБОРТ', 'АБХАЗ', 'АВЕНЮ', 'АВТОР', 'АГЕНТ', 'АГНЕЦ', 'АДЕПТ', 'АДРЕС', 'АДСКИ', 'АЖГОН', 'АЗАРТ',
              'АЗИАТ', 'АЙМАК', 'АЙРАН', 'АЙРОЛ', 'АЙСОР', 'АКАЖУ', 'АКАНТ', 'АКАНФ', 'АКАТЬ', 'АКСОН', 'АКТЕР',
              'АКТИВ', 'АКТИВ', 'АКУЛА', 'АКЦИЗ', 'АКЦИЯ', 'АЛГОЛ', 'АЛЕТЬ', 'АЛЕУТ', 'АЛИБИ', 'АЛКИЛ', 'АЛЛАХ',
              'АЛЛЕЯ', 'АЛЛОД', 'АЛМАЗ', 'АНИОН', 'АНКЕР', 'АНОНА', 'АНОНС', 'АНТИК', 'АНТРЕ', 'АНФАС', 'АНЧАР',
              'АОРТА', 'АПЕКС', 'АПНОЭ', 'АПОРТ', 'АПРОШ', 'АРБУЗ', 'АРГОН', 'АРГУС', 'АРЕАЛ', 'АРЕНА', 'АРЕСТ',
              'БАНАН', 'БАСМА', 'БЕЙКА', 'БИЛЕТ', 'БЛУЗА', 'БОРДО', 'БРЕШЬ', 'БУКЕТ', 'БУТСЫ', 'БАРАН', 'ВЯЩИЙ',
              'ВАЛЕТ', 'ВВЕРХ', 'ВЕКША', 'ВЕТКА', 'ВЗРЫВ', 'ВИХОР', 'ВНЯТЬ', 'ВОКАЛ', 'ВПРОК', 'ГЕЙША', 'ГЛИСТ',
              'ГОЛОС', 'ГОФРЕ', 'ГРУНТ', 'ГУСЕМ', 'ГАЛКА', 'ГЕТТО', 'ГНИДА', 'ГОМОН', 'ДЕВИЗ', 'ДИВАН', 'ДОИТЬ',
              'ДОХОД', 'ДРОЖЬ', 'ДУШКА', 'ДАЛЕЕ', 'ДЕЛЕЖ', 'ДИЧОК', 'ДОМОЙ', 'ЕЖЕЛИ', 'ЕКАТЬ', 'ЕДКИЙ', 'ЕЗЖАЙ',
              'ЕХАТЬ', 'ЕГЕРЬ', 'ЕГОЗА', 'ЕЗДОК', 'ЕСАУЛ', 'ЕВРЕИ', 'ЖАТВА', 'ЖИЛЕТ', 'ЖЕЛЧЬ', 'ЖИРАФ', 'ЖАБРЫ',
              'ЖЕСТЬ', 'ЖРАТЬ', 'ЖАРОК', 'ЖИЗНЬ', 'ЖУЧОК', 'ЗАСОЛ', 'ЗЕВОК', 'ЗРАЗЫ', 'ЗАБЕГ', 'ЗАЖИМ', 'ЗАМОР',
              'ЗАУМЬ', 'ЗЕФИР', 'ЗЫБКА', 'ЗАВОД', 'ИЗБАЧ', 'ИНДУС', 'ИУДЕИ', 'ИЗГИБ', 'ИПРИТ', 'ИГРОК', 'ИЗЫСК',
              'ИСПУГ', 'ИЖИЦА', 'ИМЕТЬ', 'КАЙМА', 'КАНОН', 'КАТАР', 'КЕНАФ', 'КИЧКА', 'КНИГА', 'КОКОС', 'КОНЕЦ',
              'КОРЧИ', 'КРАГИ', 'ЛАЯТЬ', 'ЛЕПЕТ', 'ЛИМИТ', 'ЛОБОК', 'ЛУНКА', 'ЛАДАН', 'ЛАМПА', 'ЛЕГАТ', 'ЛЕТКА',
              'ЛИНИЯ', 'МАВРЫ', 'МАЛЕК', 'МАНТУ', 'МЕЗГА', 'МЕТРО', 'МНИТЬ', 'МОТИВ', 'МУМИЯ', 'МЯКИШ', 'МАЕТА',
              'НАГАН', 'НАЛЕТ', 'НАРЯД', 'НЕКИЙ', 'НИКАК', 'НОСИК', 'НАДОЙ', 'НАМЕК', 'НАЦИЯ', 'НЕРПА', 'ОБИДА',
              'ОБУЗА', 'ОЖЕЧЬ', 'ОКСИД', 'ОПАЛА', 'ОРАЛО', 'ОСОБЬ', 'ОТДЕЛ', 'ОТРЯД', 'ОЧЕРК', 'ПИСЕЦ', 'ПЛЕЧО',
              'ПОЖНЯ', 'ПОЛБА', 'ПОМОР', 'ПОСАД', 'ПОЧКА', 'ПРИЮТ', 'ПУЛЬС', 'ПЫШКА', 'СВАХА', 'СДУТЬ', 'СЕРИЯ',
              'СИЗЫЙ', 'СКАЛА', 'СЛАВА', 'СМЕНА', 'СНОВА', 'СОПКА', 'СОФИТ', 'РАЗВЕ', 'РАХИТ', 'РЕЗКА', 'РИФМА',
              'РОЛИК', 'РУИНА', 'РЫНДА', 'РАЛЛИ', 'РВАТЬ', 'РЕЛЬС', 'ТОЩИЙ', 'ТРОПА', 'ТУРКА', 'ТЯПКА', 'ТАБУН',
              'ТАНЕЦ', 'ТЕИЗМ', 'ТЕЧКА', 'ТОЛКИ', 'ТОПАЗ', 'УЗКИЙ', 'УНЦИЯ', 'УТИЦА', 'УВИТЬ', 'УКРОП', 'УСЕЧЬ',
              'УЧЕБА', 'УДИЛА', 'УМЕТЬ', 'УСТУП', 'ФАЗАН', 'ФЕСКА', 'ФИННЫ', 'ФРАНК', 'ФАЛЬЦ', 'ФИЗИК', 'ФЛЕШЬ',
              'ФРОНТ', 'ФАУНА', 'ФИЛОН', 'ХАЙЛО', 'ХИМИЯ', 'ХОЛОП', 'ХУРАЛ', 'ХАМСА', 'ХЛЫСТ', 'ХОРАЛ', 'ХВОРЬ',
              'ХОБОТ', 'ХОХМА', 'ЦИТРА', 'ЦВЕТО', 'ЦЫПКА', 'ЦЕНТР', 'ЦИНИК', 'ЦАПЛЯ', 'ЦУЦИК', 'ЦЕЛЫЙ', 'ЦИНГА',
              'ЦАПКА', 'ЧАЯТЬ', 'ЧЕШУЯ', 'ЧУДИК', 'ЧЕРВЬ', 'ЧИСЛО', 'ЧУКЧИ', 'ЧУРКА', 'ЧАЛМА', 'ЧЕРТА', 'ЧРЕЗО',
              'ШАВКА', 'ШАТЕН', 'ШЕРИФ', 'ШКОДА', 'ШПАТЫ', 'ШТУКА', 'ШАЛАШ', 'ШАХТА', 'ШИПУН', 'ШЛЮХА', 'ЩЕПКА',
              'ЩИТОК', 'ЩЕНОК', 'ЩИПЦЫ', 'ЩЕЛОК', 'ЩИПОК', 'ЩЕЛКА', 'ЩЕЧКА', 'ЩЕКОТ', 'ЩЕТКА', 'ЭСКИЗ', 'ЭЛИТА',
              'ЭРКЕР', 'ЭКРАН', 'ЭРЗАЦ', 'ЭТНОС', 'ЭКЛЕР', 'ЭПОХА', 'ЭТИКА', 'ЭВЕНЫ', 'ЮКОЛА', 'ЮНОША', 'ЮДОЛЬ',
              'ЮННАТ', 'ЮНКЕР', 'ЮНИОР', 'ЮРКИЙ', 'ЮЛИТЬ', 'ЮРИСТ', 'ЯГЕЛЬ', 'ЯХОНТ', 'ЯКОРЬ', 'ЯРЛЫК', 'ЯВНЫЙ',
              'ЯСТЫК', 'ЯКОБЫ', 'ЯРКИЙ', 'ЯВИТЬ', 'ЯСТВО']

SevenLetter = ['АВТОКАР', 'АККУРАТ', 'АЛХИМИЯ', 'АНТЕННА', 'АРИТМИЯ', 'АТОМНИК', 'АБРАЗИВ', 'АДВОКАТ', 'АКТРИСА',
               'АММОНИЙ', 'БАСОВЫЙ', 'БЕГЕМОТ', 'БЕЗУСЫЙ', 'БИЛЕТЕР', 'БЛИНДАЖ', 'БОЙНИЦА', 'БОРЖОМИ', 'БРАСЛЕТ',
               'БРОСИТЬ', 'БУЙСТВО', 'ВЛИТЬСЯ', 'ВНУШИТЬ', 'ВОДЯНОЙ', 'ВОЛДЫРЬ', 'ВОПРЕКИ', 'ВПЕРВОЙ', 'ВПУТАТЬ',
               'ВСЕОБУЧ', 'ВСУЧИТЬ', 'ВХОДНОЙ', 'ГНЕВИТЬ', 'ГОЛУБОЙ', 'ГОРЕНКА', 'ГОРЯНКА', 'ГРЕБЕНЬ', 'ГРОЗИТЬ',
               'ГРУЗНЫЙ', 'ГАИШНИК', 'ГАШЕНЫЙ', 'ГЕРОЛЬД', 'ГЕРАЛЬТ', 'ДАЛЕКИЙ', 'ДЕБИТОР', 'ДЕЛОВОЙ', 'ДЕРНИНА',
               'ДЕЯТЕЛЬ', 'ДИНАМИТ', 'ДОВЕРИЕ', 'ДОЛЕВОЙ', 'ДОПЛАТА', 'ДОСЫЛКА', 'ЕЛОЧНЫЙ', 'ЕРОШИТЬ', 'ЕЖЕВИКА',
               'ЕЛОЗИТЬ', 'ЕРМОЛКА', 'ЕДИНИЦА', 'ЕЛЕЙНЫЙ', 'ЕПИСКОП', 'ЕГОЗИТЬ', 'ЕЗЖЕНЫЙ', 'ЖЕВАНЫЙ', 'ЖЕРЕБАЯ',
               'ЖУРАВЛЬ', 'ЖЕЛТЕТЬ', 'ЖИВИНКА', 'ЖАНДАРМ', 'ЖЕНАТИК', 'ЖИРОВИК', 'ЖВАЧНЫЙ', 'ЖЕРДИНА', 'ЗАВИТОК',
               'ЗАДАТОК', 'ЗАКОЛКА', 'ЗАМЫСЕЛ', 'ЗАПЕВКА', 'ЗАРОСЛЬ', 'ЗАСТАТЬ', 'ЗАУМНЫЙ', 'ЗВЕРЮГА', 'ЗЕМЩИНА',
               'ИСТОРИЯ', 'ИЗВЕСТИ', 'ИЗУМИТЬ', 'ИМПУЛЬС', 'ИНТРИГА', 'ИСПАНКА', 'ИШАЧИТЬ', 'ИГРАНЫЙ', 'ИЗДАВНА',
               'ИЗЮМИНА', 'КРАТНЫЙ', 'КРИЧАТЬ', 'КАЗАКИН', 'КРУЧИНА', 'КАЛЬЦИЙ', 'КУВАЛДА', 'КАНТАТА', 'КУРИНЫЙ',
               'КАРКАТЬ', 'КАУСТИК', 'ЛАЗЕЙКА', 'ЛАЯТЬСЯ', 'ЛЕЖАНКА', 'ЛЕСОВОЗ', 'ЛИНЯЛЫЙ', 'ЛИЧИНКА', 'ЛОКАЦИЯ',
               'ЛУЖАЙКА', 'ЛЬНЯНОЙ', 'ЛАКРИЦА', 'МЕТЕЛКА', 'МИЛИЦИЯ', 'МЛАДШИЙ', 'МОЛИТВА', 'МОРГАТЬ', 'МОТОБОЛ',
               'МУРАВЕЙ', 'МЫЛЬНЫЙ', 'МАГНЕТО', 'МАЛАХИТ', 'НЕУДАЧА', 'НИПОЧЕМ', 'НОЖНИЦЫ', 'НЯНЧИТЬ', 'НАВЕСТИ',
               'НАГОНЯЙ', 'НАЕДАТЬ', 'НАКАЧКА', 'НАМНОГО', 'НАПОИТЬ', 'ОТРАСЛЬ', 'ОТСТУПЯ', 'ОХЛОПОК', 'ОЧКОВЫЙ',
               'ОБИВАТЬ', 'ОБЛОЖКА', 'ОБОЙЩИК', 'ОБТИРКА', 'ОВЕВАТЬ', 'ОГОЛИТЬ', 'ПОДНЯТЬ', 'ПРОТОКА', 'ПОДСЕЧЬ',
               'ПРЫГАТЬ', 'ПОЖИТКИ', 'ПУЛЕВОЙ', 'ПОКРАЖА', 'ПУТАНИК', 'ПОЛИВКА', 'ПАКГАУЗ', 'РАВНЯТЬ', 'РАЗЖЕЧЬ',
               'РАКУШКА', 'РАССВЕТ', 'РВАТЬСЯ', 'РЕЕЧНЫЙ', 'РЕПОЛОВ', 'РИКОШЕТ', 'РОДНИТЬ', 'РОСИНКА', 'САНИТАР',
               'СНАРУЖИ', 'СБИРАТЬ', 'СОБАЧКА', 'СВАРНОЙ', 'СОЗВАТЬ', 'СВИВАТЬ', 'СОЛОНКА', 'СВОЛОТА', 'СОРТНЫЙ',
               'ТАИТЬСЯ', 'ТАЧАНКА', 'ТЕМНИТЬ', 'ТЕСЕМКА', 'ТИСКАТЬ', 'ТОННЕЛЬ', 'ТОШНОТА', 'ТРАУЛЕР', 'ТРИБУНА',
               'ТРУСИКИ', 'УРОДИНА', 'УСОБИЦА', 'УТКНУТЬ', 'УТЯТИНА', 'УЧИТЬСЯ', 'УБОЙНЫЙ', 'УВОДИТЬ', 'УГЛОМЕР',
               'УДАЧНИК', 'УЖИНАТЬ', 'ФАНАТИК', 'ФИЛОСОФ', 'ФОРШМАК', 'ФЮЗЕЛЯЖ', 'ФЕВРАЛЬ', 'ФЛАГМАН', 'ФРОНДЕР',
               'ФАВОРИТ', 'ФИГОВЫЙ', 'ФОЛИАНТ', 'ХВОРОСТ', 'ХЛОПОТЫ', 'ХОЛЕНЫЙ', 'ХРАПЕТЬ', 'ХАНЖИТЬ', 'ХИТРИТЬ',
               'ХМЕЛЕТЬ', 'ХОРОВОД', 'ХРОМАТЬ', 'ХВАТИТЬ', 'ЦАРСКИЙ', 'ЦЕПОЧКА', 'ЦЕВНИЦА', 'ЦИКОРИЙ', 'ЦЕЛИКОМ',
               'ЦИТРУСЫ', 'ЦАРЕВНА', 'ЦЕПЛЯТЬ', 'ЦВЕТНОЙ', 'ЦИГЕЙКА', 'ЧУЖАНИН', 'ЧАРОДЕЙ', 'ЧЕКМЕНЬ', 'ЧЕРНИТЬ',
               'ЧИРКАТЬ', 'ЧУПРИНА', 'ЧАСТИЦА', 'ЧЕМПИОН', 'ЧЕСТИТЬ', 'ЧИТАЛКА', 'ШАМКАТЬ', 'ШЕЗЛОНГ', 'ШИШКАРЬ',
               'ШПАРИТЬ', 'ШТУРМАН', 'ШАРОВОЙ', 'ШЕРШЕНЬ', 'ШЛЕПАТЬ', 'ШТАБЕЛЬ', 'ШУМОВОЙ', 'ЩЕПОТКА', 'ЩУРЕНОК',
               'ЩЕБЕТУН', 'ЩЕЛКАТЬ', 'ЩИПЧИКИ', 'ЩЕБЕНКА', 'ЩЕЛЕВОЙ', 'ЩЕТИНКА', 'ЩЕКОТКА', 'ЩЕРБИНА', 'ЭЛЕМЕНТ',
               'ЭСКАДРА', 'ЭМБРИОН', 'ЭСТОНЦЫ', 'ЭКСКУРС', 'ЭНЕРГИЯ', 'ЭЛАСТИК', 'ЭРОТИКА', 'ЭМБЛЕМА', 'ЭСТЕТИК',
               'ЮБОЧНИК', 'ЮТИТЬСЯ', 'ЮСТИЦИЯ', 'ЮРКНУТЬ', 'ЮМОРИСТ', 'ЯБЛОЧКО', 'ЯРЕМНЫЙ', 'ЯГОДИЦА', 'ЯЧНЕВЫЙ',
               'ЯДРЫШНО', 'ЯБЕДНИК', 'ЯНЫЧАРЫ', 'ЯГНЕНОК', 'ЯЧЕСТВО', 'ЯДРЕНЫЙ']

NineLetter = ['АББАТСТВО', 'АВТОХТОНЫ', 'АЛКОГОЛИК', 'АНГЛИЧАНЕ', 'АНТРЕСОЛИ', 'АССИСТЕНТ', 'АВАРИЙНЫЙ', 'АГРОХИМИЯ',
              'АЛЬПИНАДА', 'АННОТАЦИЯ', 'БОМБАРДИР', 'БРАДОБРЕЙ', 'БРЫКАТЬСЯ', 'БУТАФОРИЯ', 'БАЛАБОЛКА', 'БАТАЛЬНЫЙ',
              'БЕЗДЕТНЫЙ', 'БЕЛОКУРЫЙ', 'БЕСТОЛОЧЬ', 'БЛИЖАЙШИЙ', 'ВТЕМЯШИТЬ', 'ВЪЕДАТЬСЯ', 'ВЫГЛЯДЕТЬ', 'ВЫЖЕЛТИТЬ',
              'ВАНДАЛИЗМ', 'ВЫНЕСТИТЬ', 'ВДРЕБЕЗГИ', 'ВЫПРЯМИТЬ', 'ВЕРОВАНИЕ', 'ВЫСЛЕДИТЬ', 'ГАЛОШНИЦА', 'ГЕРМАНИЗМ',
              'ГЛАГОЛАТЬ', 'ГНЕВАТЬСЯ', 'ГОЛОПУЗЫЙ', 'ГОРОЖАНИН', 'ГРЕЙПФРУТ', 'ГРУДНИЧОК', 'ГАСТРОЛЕР', 'ГИБЕЛЬНЫЙ',
              'ДЕЛЕГАЦИЯ', 'ДЕРНИСТЫЙ', 'ДИАЛЕКТИК', 'ДИСПЕТЧЕР', 'ДОВОЛЬНЫЙ', 'ДОЛБАНУТЬ', 'ДОПРОСИТЬ', 'ДОУЧИТЬСЯ',
              'ДРУЖИТЬСЯ', 'ДВИГАТЬСЯ', 'ЕРОШИТЬСЯ', 'ЕВРОПЕЙЦЫ', 'ЕЖЕГОДНЫЙ', 'ЕВАНГЕЛИЕ', 'ЕЖЕГОДНИК', 'ЕЖЕВИЧНИК',
              'ЕССЕНТУКИ', 'ЕДИНИЧНЫЙ', 'ЕРУНДОВЫЙ', 'ЕГОЗЛИВЫЙ', 'ЖИЗНЕННЫЙ', 'ЖАЛОВАНЬЕ', 'ЖУРНАЛИСТ', 'ЖЕМАНСТВО',
              'ЖИВОПИСЕЦ', 'ЖАДНИЧАТЬ', 'ЖУИРОВАТЬ', 'ЖЕЛУДОЧЕК', 'ЖИВОДЕРНЯ', 'ЖАВОРОНОК', 'ЗАПНУТЬСЯ', 'ЗАПРЯТАТЬ',
              'ЗАСКОЧИТЬ', 'ЗАСРАМИТЬ', 'ЗАТАВРИТЬ', 'ЗАТРЕЩАТЬ', 'ЗАХЛОПАТЬ', 'ЗАШТОПАТЬ', 'ЗЕМЕЛЬНЫЙ', 'ЗОДЧЕСТВО',
              'ИЗВЕСТИСЬ', 'ИЗЛЕЧЕНИЕ', 'ИЗУМЛЕНИЕ', 'ИМПЕРАТИВ', 'ИНКУБАЦИЯ', 'ИРРИГАТОР', 'ИСПОДНИЗУ', 'ИСТАСКАТЬ',
              'ИСЧИРКАТЬ', 'ИГЛОКОЖИЕ', 'КАЗНОКРАД', 'КАПЕЛЬНЫЙ', 'КАРТЕЖНИК', 'КАТОРЖНЫЙ', 'КИНОФИЛЬМ', 'КЛИЕНТУРА',
              'КОГТИСТЫЙ', 'КОЛОТУШКА', 'КОМПАРТИЯ', 'КОНТРУДАР', 'ЛЕБЕДЕНОК', 'ЛЕТОПИСЕЦ', 'ЛОХМАТИТЬ', 'ЛЕЙТМОТИВ',
              'ЛИТАВРИСТ', 'ЛУПЦЕВАТЬ', 'ЛАЗОРЕВЫЙ', 'ЛЕНТОЧНЫЙ', 'ЛИЦИМЕРИЕ', 'ЛАТИНСКИЙ', 'МАЛЕНЬКИЙ', 'МАСЛЕНИЦА',
              'МЕДВЕДИЦА', 'МЕТОНИМИЯ', 'МИМОХОДОМ', 'МОГИЛЬНИК', 'МОЛОЖАВЫЙ', 'МОНТАЖНИК', 'МУЗЫКОВЕД', 'МЯСОРУБКА',
              'НАПРЯЧЬСЯ', 'НАСКАЗАТЬ', 'НАСТЕГАТЬ', 'НАСТУЧАТЬ', 'НАУСЬКАТЬ', 'НАЧИНАНИЕ', 'НЕБОСКЛОН', 'НЕВНЯТНЫЙ',
              'НЕДОНОСОК', 'НЕКОТОРЫЙ', 'ОТУЧИТЬСЯ', 'ОБШАРКАТЬ', 'ОТШЛЕПАТЬ', 'ОГЛОХНУТЬ', 'ОЦЕПЕНЕТЬ', 'ОДИНАРНЫЙ',
              'ОЩЕРИТЬСЯ', 'ОДУМАТЬСЯ', 'ОКИСЛЕНИЕ', 'ОКРУЖЕНИЕ', 'ПОСТОЯЛЕЦ', 'ПОДКИНУТЬ', 'ПРОЖЕКТОР', 'ПОТЕНЦИАЛ',
              'ПОДЛИПАЛА', 'ПРОИСТЕЧЬ', 'ПОТЧЕВАТЬ', 'ПОДМОЧИТЬ', 'ПРОКУСАТЬ', 'ПОЧУЯТЬСЯ', 'РАЗНИМАТЬ', 'РАЗОРВАТЬ',
              'РАЗЪЕДАТЬ', 'РАСКОВАТЬ', 'РАСПАШНОЙ', 'РАСПУТНИК', 'РАССТИЛКА', 'РАСТОЧАТЬ', 'РАСШИВНОЙ', 'РЕВОЛЮЦИЯ',
              'СРАВНИМЫЙ', 'СЕДЕЛЬЩИК', 'СТАНКОВЫЙ', 'СЕМИТОЛОГ', 'СТЕКЛОДУВ', 'СЕРЬЕЗНЫЙ', 'СТИХОПЛЕТ', 'СИНЕКДОХА',
              'СТРАТЕГИЯ', 'СКАЛИТЬСЯ', 'ТАНЦУЛЬКА', 'ТЕЛЕФОНИЯ', 'ТЕРРАРИУМ', 'ТОКСИЧНЫЙ', 'ТОРМОШИТЬ', 'ТРЕБОВАТЬ',
              'ТРЕХЛЕТИЕ', 'ТРУБЧАТЫЙ', 'ТЮБЕТЕЙКА', 'ТАБАКОВОД', 'УВИЛЬНУТЬ', 'УВЛАЖНИТЬ', 'УДАВИТЬСЯ', 'УДУШЛИВЫЙ',
              'УКОЛОТЬСЯ', 'УМЕРТВИТЬ', 'УПАДОЧНЫЙ', 'УПРОСТИТЬ', 'УСИЛЕННЫЙ', 'УСТРЕМИТЬ', 'ФАНФАРИСТ', 'ФИКТИВНЫЙ',
              'ФОНОЛОГИЯ', 'ФУТУРОЛОГ', 'ФАБРИКАНТ', 'ФАТОВСКОЙ', 'ФИЛОЛОГИЯ', 'ФОРМОВАТЬ', 'ФАКТИЧНЫЙ', 'ФЕНОЛОГИЯ',
              'ХЛОПКОВОД', 'ХОЛОСТИТЬ', 'ХРОНОСКОП', 'ХАНЖЕСКИЙ', 'ХЛОПЧАТЫЙ', 'ХОХЛИТЬСЯ', 'ХУЛИГАНЬЕ', 'ХВОСТАТЫЙ',
              'ХОЗРАСЧЕТ', 'ХРАНИТЬСЯ', 'ЦЫГАНСКИЙ', 'ЦЕПЛЯТЬСЯ', 'ЦЕХОВЩИНА', 'ЦЕЛЛУЛОИД', 'ЦИКЛОТРОН', 'ЦИФЕРБЛАТ',
              'ЦЕНТРОВОЙ', 'ЦЕСАРЕВНА', 'ЦВЕТИСТЫЙ', 'ЦИКЛИЧНЫЙ', 'ЧЕРВОННЫЙ', 'ЧЕТЫРЕЖДЫ', 'ЧАСТНОСТЬ', 'ЧЕРНЕТЬСЯ',
              'ЧИСТИТЬСЯ', 'ЧЕЛОБИТЬЕ', 'ЧЕРСТВЕТЬ', 'ЧОКНУТЬСЯ', 'ЧЕРВЛЕНЫЙ', 'ЧЕТВЕРТЫЙ', 'ШАМПИНЬОН', 'ШЕЛУДИВЫЙ',
              'ШНУРОВАТЬ', 'ШАХМАТИСТ', 'ШЕРХЕБЕЛЬ', 'ШПАРГАЛКА', 'ШВЫРЯТЬСЯ', 'ШИШКОВАТЬ', 'ШТОРМОВКА', 'ШАГИСТИКА',
              'ЩИКОЛОТКА', 'ЩИТОВИДКА', 'ЭКСПАНСИЯ', 'ЭПИЛЕПСИЯ', 'ЭКЗЕКУТОР', 'ЭЛЕГИЧНЫЙ', 'ЭСКАЛАЦИЯ', 'ЭКОНОМИКА',
              'ЭНТУЗИАЗМ', 'ЭТАЖНОСТЬ', 'ЭКСЛИБРИС', 'ЭПИКУРЕЕЦ', 'ЮНОШЕСТВО', 'ЮВЕЛИРНЫЙ', 'ЯЗЫКАСТЫЙ', 'ЯСТРЕБИЦА',
              'ЯСНОВИДЕЦ', 'ЯЗЫЧЕСТВО']

import random
import sys
import pygame

#from Game.classes import *
from Game.data import *
from Game.func import *
from Game.data import *

debug = True


def _comparsion(st1, st2):
    a = 0
    for i in range(0, len(st1)):
        if st1[i] == st2[i]:
            a += 1
    return a


def _form_lst(dict, width, height):
    lst = []
    for _ in range(height):
        lstx = []
        for _ in range(width):
            i = random.randint(0, len(dict) - 1)
            lstx.append(dict[i])
            dict.pop(i)
        lst.append(lstx)

    return lst


class Fallout(object):
    def __init__(self, difficulty):
        self.difficulty = difficulty
        self.width = 9
        self.height = 4
        self.bg = pygame.image.load(BG_FALLOUT)

        if difficulty == 0:
            self.num_lives = 10
            self.lst = _form_lst(FiveLetter, self.width, self.height)
        elif difficulty == 1:
            self.num_lives = 7
            self.lst = _form_lst(SevenLetter, self.width, self.height)
        elif difficulty == 2:
            self.num_lives = 5
            self.lst = _form_lst(NineLetter, self.width, self.height)

        i = random.randint(0, len(self.lst) - 1)
        self.word = self.lst[i][random.randint(0, len(self.lst[i]) - 1)]

        if debug:
            print(self.lst, self.word, sep='\n')

    def check(self, word):

        if debug:
            print(_comparsion(self.word, word))

        return _comparsion(self.word, word)


def main(screen):
    f1 = pygame.font.Font(None, 18)
    running = True
    clock = pygame.time.Clock()
    board = Fallout(1)
    x = y = 0
    text2 = f1.render('', 1, (0, 0, 0))
    MOUSE_CLICK = False
    WIN = None
    while running:
        screen.fill((0, 0, 0))
        st = 'Тебе нужно за ' + str(board.num_lives) + ' попыток найти слово'
        text1 = f1.render(st, 1, (0, 0, 0))
        for event in pygame.event.get():
            if event.type == pygame.QUIT:
                running = False
            if event.type == pygame.MOUSEBUTTONDOWN and WIN is None:
                x, y = pygame.mouse.get_pos()
                MOUSE_CLICK = True

        screen.blit(board.bg, (0, 0))
        for i in range(0, board.height):
            for j in range(0, board.width):
                text = f1.render(board.lst[i][j], 1, (150, 0, 0))
                x0, y0, dx, dy = text.get_rect()
                a = 70 + 100*j
                b = 70 + 140*i
                screen.blit(text, (a, b))
                if x0 + a <= x <= x0 + dx + a and y0 + b <= y <= y0 + dy + b and MOUSE_CLICK:
                    MOUSE_CLICK = False
                    board.num_lives -= 1
                    if board.check(board.lst[i][j]) == len(board.lst[i][j]):
                        st = 'АБСОЛЮТНАЯ ПОБЕДА! Ты нашёл слово за заданное число попыток'
                        text2 = f1.render(st, 1, (0, 0, 0))
                        WIN = True
                    elif board.num_lives:
                        st = 'В слове, которое вы выбрали ' + str(board.check(board.lst[i][j])) + \
                             ' совпадений с тем словом, которое было выбрано игрой'
                        text2 = f1.render(st, 1, (0, 0, 0))
                    else:
                        st = 'DEFEAT!'
                        text2 = f1.render(st, 1, (0, 0, 0))
                        WIN = False

        screen.blit(text1, (20, 20))
        screen.blit(text2, (WIDTH // 2 - text2.get_rect()[2] // 2, HEIGHT // 2 - text2.get_rect()[3] // 2))

        pygame.display.update()
        clock.tick(FPS)


if __name__ == '__main__':
    sys.exit()
